ИБПрактика4/src/Documents/ЗакупкаИнгредиентов/ЗакупкаИнгредиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакупкаИнгредиентов</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>ТорговаяТочка</name>
    <type>
      <types>CatalogRef.ЗаведенияСети</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Поставщики</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНакладной</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.КофеИНапитки</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИБПрактика4/src/Documents/ЗакупкаИнгредиентов/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция СоставЧекаНоменклатураПриИзмененииНаСервере(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КофеИНапитки.ЦенаПродажи КАК ЦенаПродажи
		|ИЗ
		|	Справочник.КофеИНапитки КАК КофеИНапитки
		|ГДЕ
		|	КофеИНапитки.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ЦенаПродажи;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

&НаКлиенте
Процедура СоставЧекаНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Состав.ТекущиеДанные;
	
	ТекущаяСтрока.Цена = СоставЧекаНоменклатураПриИзмененииНаСервере(ТекущаяСтрока.Товар);
КонецПроцедуры

&НаКлиенте
Процедура СоставЧекаКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Состав.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
	
	Объект.Сумма =  Объект.Состав.Итог("Сумма");

КонецПроцедуры

&НаКлиенте
Процедура СоставЧекаЦенаПриИзменении(Элемент)
		ТекущаяСтрока = Элементы.Состав.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
	
	Объект.Сумма =  Объект.Состав.Итог("Сумма");

КонецПроцедуры
